# ST207 Assignment 2 MT2022

## 43727

In [1]:
import os 
import sqlite3
import pandas as pd

### Connecting to Databases Using Python

In [2]:
try:
    os.remove('Company.db')
except OSError:
    pass

In [3]:
conn = sqlite3.connect('Company.db')

In [4]:
c = conn.cursor()

### Creating Tables Using Python

Create `EMPLOYEE` table

In [5]:
c.execute('''
CREATE TABLE EMPLOYEE (
    employee_id INTEGER NOT NULL,
    first_name CHAR(100),
    last_name CHAR(40),
    date_of_birth DATE FORMAT 'yyyy-mm-dd',
    hire_date DATE FORMAT 'yyyy-mm-dd' NOT NULL,
    sex CHAR(40),
    salary FLOAT NOT NULL,
PRIMARY KEY (employee_id)
);
''')

In [6]:
conn.commit()

Create `EMPLOYEE_LOG` table

In [7]:
c.execute('''
CREATE TABLE EMPLOYEE_LOG (
    employee_id INTEGER NOT NULL,
    description CHAR(100) NOT NULL,
FOREIGN KEY (employee_id) REFERENCES EMPLOYEE(employee_id) 
ON DELETE SET NULL
ON UPDATE CASCADE
);
''')

In [8]:
conn.commit()

Add `supervisor_id` as a foreign key to the `EMPLOYEE` table

In [9]:
c.execute('''
ALTER TABLE EMPLOYEE
ADD COLUMN supervisor_id INTEGER NOT NULL 
REFERENCES EMPLOYEE(employee_id)
ON DELETE SET NULL
ON UPDATE CASCADE;
''')

In [10]:
conn.commit()

Create `DEPARTMENT` table

In [11]:
c.execute('''
CREATE TABLE DEPARTMENT (
    department_id INTEGER NOT NULL,
    department_name CHAR(100),
    supervisor_id INTEGER NOT NULL,
    supervisor_start_date DATE FORMAT 'yyyy-mm-dd' NOT NULL,
PRIMARY KEY (department_id),
FOREIGN KEY (supervisor_id) REFERENCES EMPLOYEE(employee_id) 
ON DELETE SET NULL
ON UPDATE CASCADE
);''')

In [12]:
conn.commit()

Add `department_id` as a foreign key to the `EMPLOYEE` table

In [13]:
c.execute('''
ALTER TABLE EMPLOYEE
ADD COLUMN department_id INTEGER NOT NULL
REFERENCES DEPARTMENT(department_id)
ON DELETE SET NULL
ON UPDATE CASCADE;
''')

In [14]:
conn.commit()

Create `CLIENT` table

In [15]:
c.execute('''
CREATE TABLE CLIENT (
    client_id INTEGER NOT NULL,
    client_name CHAR(100),
    department_id INTEGER NOT NULL,
PRIMARY KEY (client_id),
FOREIGN KEY (department_id) REFERENCES DEPARTMENT(department_id) 
ON DELETE SET NULL
ON UPDATE CASCADE
);
''')

In [16]:
conn.commit()

CREATE `PRODUCT` table

In [17]:
c.execute('''
CREATE TABLE PRODUCT (
    product_id INTEGER NOT NULL,
    cost FLOAT NOT NULL,
    price FLOAT NOT NULL,
    product_type CHAR(100) NOT NULL,
PRIMARY KEY (product_id),
FOREIGN KEY (product_id) REFERENCES PRODUCT(product_id) 
ON DELETE SET NULL
ON UPDATE CASCADE
);
''')

In [18]:
conn.commit()

Create `DEPARTMENT_SUPPLIER` table

In [19]:
c.execute('''
CREATE TABLE DEPARTMENT_SUPPLIER (
    department_id INTEGER NOT NULL,
    supplier_brand CHAR(100) NOT NULL,
    product_id INTEGER NOT NULL,
PRIMARY KEY (department_id, supplier_brand),
FOREIGN KEY (department_id) REFERENCES DEPARTMENT(department_id) 
ON DELETE CASCADE
ON UPDATE CASCADE,
FOREIGN KEY (product_id) REFERENCES PRODUCT(product_id) 
ON DELETE SET NULL
ON UPDATE CASCADE
);
''')

In [20]:
conn.commit()

Create `ATTENDS_TO` table

In [21]:
c.execute('''
CREATE TABLE ATTENDS_TO (
    employee_id INTEGER NOT NULL,
    client_id INTEGER NOT NULL,
    product_id INTEGER NOT NULL,
PRIMARY KEY (employee_id, client_id),
FOREIGN KEY (employee_id) REFERENCES EMPLOYEE(employee_id) 
ON DELETE CASCADE
ON UPDATE CASCADE,
FOREIGN KEY (client_id) REFERENCES client(client_id) 
ON DELETE CASCADE
ON UPDATE CASCADE,
FOREIGN KEY (product_id) REFERENCES PRODUCT(product_id) 
ON DELETE SET NULL
ON UPDATE CASCADE
);
''')

In [22]:
conn.commit()

List all the tables

In [23]:
c.execute('''
SELECT name 
FROM sqlite_master 
WHERE type='table';
''').fetchall()

[('EMPLOYEE',),
 ('EMPLOYEE_LOG',),
 ('DEPARTMENT',),
 ('CLIENT',),
 ('PRODUCT',),
 ('DEPARTMENT_SUPPLIER',),
 ('ATTENDS_TO',)]

### Manipulating Database using Python

#### Insert & Update Tuples/Row

Insert values of supervisors into `EMPLOYEE` table

In [24]:
c.execute('''
INSERT INTO EMPLOYEE ('employee_id','first_name','last_name',
'date_of_birth','hire_date','sex','salary','supervisor_id','department_id') VALUES
(10, 'Jay','Chou','1995-01-01','2020-01-01','Male',200000,10,100),
(20, 'Joseph','Chin','1992-01-02','2020-02-01','Male',80000,20,200),
(30, 'Eric','Law','1994-01-03','2020-01-21','Male',60000,30,300);
''')

In [25]:
conn.commit()

Insert values into `DEPARTMENT` table

In [26]:
c.execute('''
INSERT INTO DEPARTMENT('department_id','department_name',
'supervisor_id','supervisor_start_date') VALUES
(100, 'ABC',10,'2020-01-01'),
(200, 'DEF',20,'2020-02-01'),
(300, 'GHI',30,'2020-01-21');
''')

In [27]:
conn.commit()

Insert values of supervisees into `EMPLOYEE` table.

In [28]:
c.execute('''
INSERT INTO EMPLOYEE ('employee_id','first_name','last_name',
'date_of_birth','hire_date','sex','salary','supervisor_id','department_id') VALUES
(11, 'Emily','Tan','1995-05-01','2020-02-01','Female',100000,10,100),
(12, 'Kanye','West','1992-05-02','2020-02-02','Male',100000,10,100),
(21, 'Kendrick','Lamar','1993-01-03','2020-03-01','Male',70000,20,200),
(22, 'Jenn','Im','1994-01-01','2020-03-02','Female',70000,20,200),
(31, 'Sky','Leo','1991-01-02','2020-01-22','Male',50000,30,300),
(32, 'Ezekiel','Tan','1994-01-03','2020-01-23','Male',50000,30,300);
''')

In [29]:
conn.commit()

Insert values into `PRODUCT` table

In [30]:
c.execute('''
INSERT INTO PRODUCT (product_id,cost,price,product_type) VALUES
(401,10,15,'Paper'),
(402,15,20,'Pen'),
(403,18,23,'Eraser'),
(404,20,25,'Paper'),
(405,10,15 ,'Paper'),
(406,15,20,'Pen'),
(407,30,33,'Eraser');
''')

Insert values into `DEPARTMENT_SUPPLIER` table

In [31]:
c.execute('''
INSERT INTO DEPARTMENT_SUPPLIER ('department_id',
'supplier_brand','product_id') VALUES
(100,'Keshi',401),
(200,'Denji',402),
(200,'Henry', 403),
(300,'Alysha',404),
(300,'Keshi',405),
(300,'Denji',406),
(300,'Harith',407);
''')

In [32]:
conn.commit()

Insert values into `CLIENT` table

In [33]:
c.execute('''
INSERT INTO CLIENT ('client_id',
'client_name','department_id') VALUES
(300,'Fanta',100),
(301,'Lynn',200),
(302,'Justin',300),
(303,'Henry',300),
(304,'Jia',300),
(305,'Emily',300),
(306,'Leo',200);
''')

In [34]:
conn.commit()

Insert values into `ATTENDS_TO` table

In [35]:
c.execute('''
INSERT INTO ATTENDS_TO ('employee_id',
'client_id','product_id') VALUES
(11,300,401),
(11,301,402),
(12,306,403),
(21,302,404),
(22,303,405),
(31,304,406),
(32,305,407);
''')

In [36]:
conn.commit()

### Views

#### Create TEMP VIEW

1i. A supplier who supplies papers wants to see the list of paper product brand that the company has. Create a temporary view `BRAND_PAPER` to show data of product type of paper only. The view `BRAND_PAPER` only demonstrates `supplier_brand` and `product type` as attributes. There is no new attributes in the view. Attributes ` department_id`, `product_id`, `cost` and `price` are hidden.

In [37]:
c.execute('''
CREATE TEMP VIEW IF NOT EXISTS BRAND_PAPER AS 
SELECT DISTINCT supplier_brand,product_type
FROM DEPARTMENT_SUPPLIER JOIN PRODUCT
ON DEPARTMENT_SUPPLIER.product_id = PRODUCT.product_id
WHERE PRODUCT.product_type = 'Paper'
''')

In [38]:
conn.commit()

#### Querying the VIEW

1ii. Query `BRAND_PAPER` view

In [39]:
brand_paper = c.execute('''
SELECT *
FROM BRAND_PAPER
''').fetchall()


brand_paper = pd.DataFrame(brand_paper)
brand_paper = brand_paper.rename({0: 'supplier_brand', 1: 'product_type'}, axis=1)
brand_paper

  supplier_brand product_type
0          Keshi        Paper
1         Alysha        Paper

1iii. It it not possible for the paper supplier to modify a view through `INSERT`, `DELETE` or `UPDATE` command

In [40]:
c.execute('''
INSERT INTO BRAND_PAPER
VALUES (200,'Keshi','Paper');
''')

OperationalError: cannot modify BRAND_PAPER because it is a view

In [47]:
c.execute('''
DELETE FROM BRAND_PAPER
where name = 'Keshi'
''')

OperationalError: cannot modify BRAND_PAPER because it is a view

In [48]:
c.execute('''
UPDATE BRAND_PAPER
SET department_id = 123
WHERE product_type = 'Paper';
''')

OperationalError: cannot modify BRAND_PAPER because it is a view

#### Create  TEMP VIEW

2i. Create a temporary view `TOP_EMPLOYEE_VIEW` to identify the employee that conduct top sales. The attribute in `TOP_EMPLOYEE_VIEW` is `employee_id`. The new attribute is `total_sales` in the view. A certificate with employee's first and last name would be printed and awarded to the employee.

In [49]:
TOP_EMPLOYEE_VIEW = c.execute('''
CREATE TEMP VIEW IF NOT EXISTS TOP_EMPLOYEE_VIEW AS
SELECT ATTENDS_TO.employee_id,SUM(PRODUCT.price) as sum
FROM ATTENDS_TO INNER JOIN PRODUCT
ON ATTENDS_TO.product_id =PRODUCT.product_id 
GROUP BY ATTENDS_TO.employee_id
ORDER BY sum DESC
LIMIT 1
''').fetchall()

In [50]:
conn.commit()

#### Querying the view

2ii. Efficient querying: The view `TOP_EMPLOYEE_VIEW` is then used in `JOIN` operation to obtain the first and last name of the employee who conduct top sales.

In [51]:
TOP_EMPLOYEE_NAME = c.execute('''
SELECT first_name, last_name
FROM TOP_EMPLOYEE_VIEW JOIN EMPLOYEE
WHERE TOP_EMPLOYEE_VIEW.employee_id = EMPLOYEE.employee_id;
''').fetchall()

TOP_EMPLOYEE_NAME = pd.DataFrame(TOP_EMPLOYEE_NAME)
TOP_EMPLOYEE_NAME = TOP_EMPLOYEE_NAME.rename({0: 'first_name', 1: 'last_name'}, axis=1)
TOP_EMPLOYEE_NAME

  first_name last_name
0      Emily       Tan

### Triggers

1. Trigger: All employees’ salaries cannot be negative. However, salaries can be zero as there are unpaid internships offered by the company.

Trigger: Disallow insertions of negative salary

In [52]:
c.execute('''
CREATE TRIGGER MIN_SALARY_INSERT
BEFORE INSERT ON EMPLOYEE
FOR EACH ROW
BEGIN
SELECT CASE
WHEN (NEW.SALARY < 0 ) 
THEN RAISE(FAIL, 'ERROR: Salary cannot be negative.')
END;
END;
''')

In [53]:
conn.commit()

Trigger: Disallow updates of negative salary

In [54]:
c.execute('''
CREATE TRIGGER MIN_SALARY_UPDATE
BEFORE UPDATE ON EMPLOYEE
FOR EACH ROW
BEGIN
SELECT CASE
WHEN (NEW.SALARY < 0 ) 
THEN RAISE(FAIL, 'ERROR: Salary cannot be negative.')
END;
END;
''')

In [55]:
conn.commit()

Testing the trigger : Insert negative salary

In [56]:
c.execute('''
INSERT INTO EMPLOYEE
VALUES (33, 'Emily','Lim','1991-05-01','2020-01-23','Female',-10000,10,100);
''')

IntegrityError: ERROR: Salary cannot be negative.

Testing the trigger : Update negative salary

In [57]:
c.execute('''
UPDATE EMPLOYEE
SET salary = -10000
WHERE employee_id = 20;
''')

IntegrityError: ERROR: Salary cannot be negative.

Testing the trigger : Insert positive salary

In [58]:
c.execute('''
INSERT INTO EMPLOYEE
VALUES (33, 'Ryan','Leo','1991-05-01','2020-01-23','Male',10000,10,100);
''')

In [59]:
conn.commit()

Testing the trigger : Update positive salary

In [60]:
c.execute('''
UPDATE EMPLOYEE
SET salary = 40000
WHERE employee_id = 33;
''')

In [61]:
conn.commit()

2. Trigger: All employees’ salaries cannot be larger than his or her supervisors.

Trigger: Disallow insertions of salary larger than his or her supervisors.

In [62]:
c.execute('''
CREATE TRIGGER SALARY_VIOLATION_INSERT
BEFORE INSERT ON EMPLOYEE
FOR EACH ROW
BEGIN
SELECT CASE
WHEN (NEW.SALARY > ( SELECT Salary FROM EMPLOYEE
  WHERE employee_id = NEW.supervisor_id) ) 
THEN RAISE(FAIL, 'ERROR: Salary cannot be larger than his or her supervisor.')
END;
END;
''')

In [63]:
conn.commit()

Trigger: Disallow updates of salary larger than his or her supervisors.

In [64]:
c.execute('''
CREATE TRIGGER SALARY_VIOLATION_UPDATE
BEFORE UPDATE ON EMPLOYEE
FOR EACH ROW
BEGIN
SELECT CASE
WHEN (NEW.SALARY > ( SELECT Salary FROM EMPLOYEE
  WHERE employee_id = NEW.supervisor_id) ) 
THEN RAISE(FAIL, 'ERROR: Salary cannot be larger than his or her supervisor.')
END;
END;
''')

In [65]:
conn.commit()

Testing the trigger : Insert salary larger than his or her supervisor

In [66]:
c.execute('''
INSERT INTO EMPLOYEE
VALUES (13, 'Ryan','Xing','1991-05-01','2020-02-03','Male',400000,10,100);
''')

IntegrityError: ERROR: Salary cannot be larger than his or her supervisor.

Testing the trigger : Update salary larger than his or her supervisor

In [67]:
c.execute('''
UPDATE EMPLOYEE
SET salary = 400000
WHERE employee_id = 12;
''')

IntegrityError: ERROR: Salary cannot be larger than his or her supervisor.

Testing the trigger : Insert salary smaller than his or her supervisor

In [68]:
c.execute('''
INSERT INTO EMPLOYEE
VALUES (14, 'Yong','Xing','1991-05-01','2020-02-04','Female',100000,10,100);
''')

In [69]:
conn.commit()

Testing the trigger : Update salary smaller than his or her supervisor

In [70]:
c.execute('''
UPDATE EMPLOYEE
SET salary = 40000
WHERE employee_id = 31;
''')

In [71]:
conn.commit()

3. Trigger: If the data is deleted from `EMPLOYEE` table, his or her employee id would be recored in`EMPLOYEE_LOG` table. The description would be denoted as 'deleted on the date that he or she quitted'.

Trigger: Record deleted employee data in `EMPLOYEE_LOG` table

In [72]:
c.execute('''
CREATE TRIGGER aft_delete AFTER DELETE ON EMPLOYEE
BEGIN
    INSERT INTO EMPLOYEE_LOG(employee_id, description)
    VALUES (OLD.employee_id, 'Deleted on '|| date('NOW'));
END;

''')

In [73]:
conn.commit()

Testing the trigger: Delete employee data from `EMPLOYEE` table

In [74]:
c.execute('''
DELETE FROM EMPLOYEE
WHERE employee_id = 31;
''')

In [75]:
conn.commit()

Data of deleted employee is recorded in `EMPLOYEE_LOG` table

In [76]:
employee_log = c.execute('''
SELECT * FROM
EMPLOYEE_LOG
''').fetchall()

employee_log = pd.DataFrame(employee_log)
employee_log = employee_log.rename({0: 'employee_id', 1: 'description'}, axis=1)
employee_log

   employee_id            description
0           31  Deleted on 2022-12-09

### SQL Commands

Identify the product that has the top sales.

In [77]:
top_product = c.execute('''
SELECT PRODUCT.product_type, COUNT(*) as total
FROM ATTENDS_TO JOIN PRODUCT
ON ATTENDS_TO.product_id = PRODUCT.product_id
GROUP BY PRODUCT.product_type
ORDER BY total DESC
LIMIT 1
''').fetchall()

In [78]:
top_product = pd.DataFrame(top_product)
top_product = top_product.rename({0: 'product_type', 1: 'total'}, axis=1)
top_product

  product_type  total
0        Paper      3

List all first and last names of supervisors, with their corresponding start date in ascending order

In [79]:
supervisor_start_date = c.execute('''
SELECT DEPARTMENT.supervisor_start_date,EMPLOYEE.first_name, EMPLOYEE.last_name
FROM EMPLOYEE INNER JOIN DEPARTMENT
ON EMPLOYEE.employee_id = DEPARTMENT.supervisor_id
ORDER BY DEPARTMENT.supervisor_start_date ASC
''').fetchall()

In [80]:
supervisor_start_date = pd.DataFrame(supervisor_start_date)
supervisor_start_date = supervisor_start_date.rename({0: 'date', 1: 'first_name',2:'last_name'}, axis=1)
supervisor_start_date

         date first_name last_name
0  2020-01-01        Jay      Chou
1  2020-01-21       Eric       Law
2  2020-02-01     Joseph      Chin

List names of clients that are managed by Joseph Chin in Deparment DEF

In [81]:
client_JC_branch200 = c.execute('''
SELECT CLIENT.client_name, DEPARTMENT.department_name, EMPLOYEE.first_name, EMPLOYEE.last_name
FROM CLIENT INNER JOIN DEPARTMENT
ON CLIENT.department_id = DEPARTMENT.department_id
INNER JOIN EMPLOYEE
ON DEPARTMENT.supervisor_id = EMPLOYEE.employee_id
WHERE EMPLOYEE.first_name = 'Joseph' AND EMPLOYEE.last_name = 'Chin';
''').fetchall()

In [82]:
client_JC_branch200 = pd.DataFrame(client_JC_branch200)
client_JC_branch200 = client_JC_branch200.rename({0: 'client_name', 1: 'department_name',2:'first_name'
                                                 ,3:'last_name'}, axis=1)
client_JC_branch200

  client_name department_name first_name last_name
0        Lynn             DEF     Joseph      Chin
1         Leo             DEF     Joseph      Chin

List departments and with largest number of clients.

In [83]:
department_client = c.execute('''
SELECT DEPARTMENT.department_name, COUNT(*) as total
FROM DEPARTMENT INNER JOIN CLIENT 
ON DEPARTMENT.department_id = CLIENT.department_id
GROUP BY DEPARTMENT.department_name
ORDER BY total DESC
LIMIT 1
''').fetchall()

In [84]:
department_client = pd.DataFrame(department_client)
department_client = department_client.rename({0: 'department_name', 1: 'no_of_client'}, axis=1)
department_client

  department_name  no_of_client
0             GHI             4

List top employee with top sales

In [85]:
top_employee = c.execute('''
SELECT EMPLOYEE.first_name,EMPLOYEE.last_name,SUM(PRODUCT.price) as sum
FROM ATTENDS_TO INNER JOIN PRODUCT
ON ATTENDS_TO.product_id =PRODUCT.product_id 
INNER JOIN EMPLOYEE
ON ATTENDS_TO.employee_id = EMPLOYEE.employee_id
GROUP BY ATTENDS_TO.employee_id
ORDER BY sum DESC
LIMIT 1
''').fetchall()

In [86]:
top_employee = pd.DataFrame(top_employee)
top_employee = top_employee.rename({0: 'first_name', 1: 'last_name',2:'top_sales'}, axis=1)
top_employee

  first_name last_name  top_sales
0      Emily       Tan       35.0

### Disconnecting from the Database

In [87]:
conn.close()